Enums/СпособРасчетаСуммыДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СпособРасчетаСуммыДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СУчетомВсехСкидок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезУчетаРучнойСкидки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезУчетаСкидок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС14</Name>
					<Comment>(Общ) Ставка НДС 14%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыСписанияОстаткаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СпособыСписанияОстаткаТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзРезерва</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбработкаТабличныхЧастейСервер/Ext/Module.bsl
// Процедура выполняет стандартные действия при изменении номенклатуры 
// в строке табличной части документа (очищает ссылки на подчиненные справочники).
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа
//  ИмяЕдиницыИзмерения  - наименование единицы измерения
//
Процедура ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ИмяТабличнойЧасти, ИмяЕдиницыИзмерения = "ЕдиницаИзмерения") Экспорт

	// При изменении номенклатуры очистим ссылки на подчиненные справочники
	Если СтрокаТабличнойЧасти.Свойство(ИмяЕдиницыИзмерения)
	   И СтрокаТабличнойЧасти.Номенклатура <> СтрокаТабличнойЧасти[ИмяЕдиницыИзмерения].Владелец Тогда
		СтрокаТабличнойЧасти[ИмяЕдиницыИзмерения] = Неопределено;
	КонецЕсли;
	
	// При изменении номенклатуры очистим единицу мест
	Если СтрокаТабличнойЧасти.Свойство("ЕдиницаИзмеренияМест")
	   И СтрокаТабличнойЧасти.Номенклатура <> СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест.Владелец Тогда
		СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест = Неопределено;
	КонецЕсли;

	Если СтрокаТабличнойЧасти.Свойство("СерияНоменклатуры")
	   И СтрокаТабличнойЧасти.Номенклатура <> СтрокаТабличнойЧасти.СерияНоменклатуры.Владелец Тогда
		СтрокаТабличнойЧасти.СерияНоменклатуры = Неопределено;
	КонецЕсли;

	Если СтрокаТабличнойЧасти.Свойство("ХарактеристикаНоменклатуры")
	   И СтрокаТабличнойЧасти.Номенклатура <> СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры.Владелец Тогда
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Неопределено;
	КонецЕсли;

КонецПроцедуры // ПриИзмененииНоменклатурыТабЧасти()

// Рассчитывает сумму в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа,
//  СпособРасчета        - "Со всеми скидками", сумма минус скидки;
//                         "Без учета ручной скидки", сумма минус автоматические скидки;
//                         "Без учета скидок", сумма (Цена * Количество);
//
Процедура РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ИмяТабличнойЧасти, ДопПараметры, СпособРасчета = Неопределено, ЗначениеПустогоКоличества = 0) Экспорт	


	Сумма = СтрокаТабличнойЧасти.Цена * ?(СтрокаТабличнойЧасти.Количество = 0, ЗначениеПустогоКоличества, СтрокаТабличнойЧасти.Количество);
	СуммаСкидки = 0;

	Если (СпособРасчета = Неопределено)
	 Или (СпособРасчета = Перечисления.СпособРасчетаСуммыДокумента.СУчетомВсехСкидок)
	 Или (СпособРасчета = Перечисления.СпособРасчетаСуммыДокумента.БезУчетаРучнойСкидки) Тогда
		Если СтрокаТабличнойЧасти.Свойство("ПроцентАвтоматическихСкидок") Тогда
			СуммаСкидки = Сумма * СтрокаТабличнойЧасти.ПроцентАвтоматическихСкидок / 100;
		КонецЕсли;

		Если (СпособРасчета <> Перечисления.СпособРасчетаСуммыДокумента.БезУчетаРучнойСкидки)Тогда
			Если СтрокаТабличнойЧасти.Свойство("ПроцентСкидкиНаценки") Тогда
				СуммаСкидки = СуммаСкидки + (Сумма * СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	СтрокаТабличнойЧасти.Сумма = Сумма - СуммаСкидки;

КонецПроцедуры // РассчитатьСуммуТабЧасти()

// Процедура выполняет стандартные действия при изменении суммы 
// в строке табличной части документа.
//
// Параметры:
//  СтрокаТабличнойЧасти                             - строка табличной части документа,
//  ДокументОбъект                                   - объект редактируемого документа,
//  ТекПользователь                                  - ссылка на текущего пользователя,
//  РасчетАвтоматическихСкидок                       - признак необходимости Расчета автоматических скидок,
//  ЕстьРеквизитДокументаПроцентСкидкиНаценки        - признак наличия в табличной части документа процента скидки (наценки), 
//  ПересчитыватьСкидкуДокумента                     - признак необходимости пересчета скидки для данного пользователя,
//  ЕстьРеквизитДокументаПроцентАвтоматическихСкидок - признак наличия в документе реквизита ПроцентАвтоматическихСкидок,
//  ИмяТабЧастиДокумента                             - имя табличной части.
//
Процедура ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ИмяТабличнойЧасти, ДопПараметры, ТекПользователь, РасчетАвтоматическихСкидок = Ложь, 
                                    ЕстьРеквизитДокументаПроцентСкидкиНаценки = Неопределено, 
                                    ПересчитыватьСкидкуДокумента = Неопределено, 
                                    ЕстьРеквизитДокументаПроцентАвтоматическихСкидок = Неопределено, 
                                    ИмяТабЧастиДокумента = Неопределено) Экспорт

	
	Если СтрокаТабличнойЧасти.Количество=0 Тогда
		СтрокаТабличнойЧасти.Цена = 0;
	Иначе	
		
		ЕстьРеквизитПроцентСкидкиНаценки = ?(ЕстьРеквизитДокументаПроцентСкидкиНаценки = Неопределено,
		                                     СтрокаТабличнойЧасти.Свойство("ПроцентСкидкиНаценки"),
		                                     ЕстьРеквизитДокументаПроцентСкидкиНаценки);

		Если ЕстьРеквизитПроцентСкидкиНаценки Тогда

			ПересчитыватьСкидку = ?(ПересчитыватьСкидкуДокумента = Неопределено, 
			                        УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ПриИзмененииСуммыПересчитыватьСкидку"),
			                        ПересчитыватьСкидкуДокумента);

			ЕстьРеквизитПроцентАвтоматическихСкидок = ?(ЕстьРеквизитДокументаПроцентАвтоматическихСкидок = Неопределено,
			                                             СтрокаТабличнойЧасти.Свойство("ПроцентАвтоматическихСкидок"), 
			                                      	     ЕстьРеквизитДокументаПроцентАвтоматическихСкидок);

			Если ПересчитыватьСкидку Тогда
				Если (СтрокаТабличнойЧасти.Цена = 0) Или (СтрокаТабличнойЧасти.Количество = 0) Тогда
					СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 0;
					Если СтрокаТабличнойЧасти.Цена = 0 Тогда
						ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Цена равна 0, после изменения суммы установлена нулевая скидка!';uk='Ціна дорівнює 0, після зміни суми встановлена нульова знижка!'"));
					Иначе
						ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Количество равно 0, после изменения суммы установлена нулевая скидка!';uk='Кількість дорівнює 0, після зміни суми встановлена нульова знижка!'"));
					КонецЕсли;
				Иначе
					СуммаСоСкидками = СтрокаТабличнойЧасти.Сумма;
					СуммаБезСкидок  = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
					ПроцентСкидки   = 100 - (СуммаСоСкидками * 100) / СуммаБезСкидок;
					ПроцентАвтоматическихСкидок = 0;

					Если ЕстьРеквизитПроцентАвтоматическихСкидок Тогда
						ПроцентАвтоматическихСкидок = СтрокаТабличнойЧасти.ПроцентАвтоматическихСкидок;
					КонецЕсли;
					СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = ПроцентСкидки - ПроцентАвтоматическихСкидок;

				КонецЕсли;
			Иначе
				Если СтрокаТабличнойЧасти.ПроцентСкидкиНаценки >= 100 Тогда
					СтрокаТабличнойЧасти.Цена = 0;
					ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Скидка равна 100%, после изменения суммы установлена нулевая цена!';uk='Знижка рівна 100%, після зміни суми встановлена нульова ціна!'"));
				Иначе
					ПроцентАвтоматическихСкидок = 0;
					Если ЕстьРеквизитПроцентАвтоматическихСкидок Тогда
						ПроцентАвтоматическихСкидок = СтрокаТабличнойЧасти.ПроцентАвтоматическихСкидок;
					КонецЕсли;
					СуммаБезСкидок  = СтрокаТабличнойЧасти.Сумма * 100/
					                  (100 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки - ПроцентАвтоматическихСкидок);
					СтрокаТабличнойЧасти.Цена = СуммаБезСкидок / СтрокаТабличнойЧасти.Количество;
				КонецЕсли;
			КонецЕсли;
		Иначе
			СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПриИзмененииСуммыТабЧасти()

// Расчет, исходя из постоянной суммы
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа.
//
Процедура РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти,ИмяТабличнойЧасти, ДопПараметры) Экспорт

	// Если в документе нет флагов учета НДС, то в конфигурации считатется, что суммы включают НДС.
	УчитыватьНДС = Истина;
	СуммаВключаетНДС = Истина;
	
	Если ДопПараметры.Свойство("УчитыватьНДС") Тогда
		УчитыватьНДС = ДопПараметры.УчитыватьНДС;
	КонецЕсли;

	Если  ДопПараметры.Свойство("СуммаВключаетНДС") Тогда
		СуммаВключаетНДС = ДопПараметры.СуммаВключаетНДС;
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти.Свойство("Сумма") И
		СтрокаТабличнойЧасти.Свойство("СтавкаНДС") Тогда

		СтрокаТабличнойЧасти.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма,
		                                                   УчитыватьНДС, СуммаВключаетНДС,
		                                                   УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
	КонецЕсли;

КонецПроцедуры // РассчитатьСуммуНДСТабЧасти()

// Процедура заполняет ставку НДС в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти     - строка табличной части документа,
//  ДокументОбъект           - объект редактируемого документа.
//
Процедура ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти,ИмяТабличнойЧасти, ДопПараметры, ВидДокумента = "") Экспорт

	//Заполнить СтавкаНДС
	Если  СтрокаТабличнойЧасти.Свойство("Номенклатура")
		И ТипЗнч(СтрокаТабличнойЧасти.Номенклатура) = Тип("СправочникСсылка.Номенклатура")
		И СтрокаТабличнойЧасти.Свойство("СтавкаНДС") Тогда
		
		ЕстьДоговорКонтрагента = ДопПараметры.Свойство("ДоговорКонтрагента");
		Внешнеэкономический = ?(ЕстьДоговорКонтрагента, ?(ДопПараметры.ДоговорКонтрагента.Внешнеэкономический = Истина, Истина, Ложь), Ложь);
		Если Внешнеэкономический И ВидДокумента = "Приобретение" Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		ИначеЕсли Внешнеэкономический И ВидДокумента = "Реализация" Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
		Иначе
			СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСтавкуНДСТабЧасти()

// Процедура заполняет способ списания товаров в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти     - строка табличной части документа,
//  ДокументОбъект           - объект редактируемого документа.
//
Процедура ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(СтрокаТабличнойЧасти) Экспорт

	СтрокаТабличнойЧасти.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;

КонецПроцедуры // ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти()

// Процедура заполняет единицу и цену по ценам продажи в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти           - строка табличной части документа,
//  ДокументОбъект                 - объект редактируемого документа.
//  ВалютаРегламентированногоУчета - валюта регламентированного учета,
//  ВалютаДокумента                - необязательный параметр, валюта, в которой надо заполнить цену,
//                                   если не задан, то цена заполняется в валюте документа,
//                                   если нет валюты документа, то в валюте упр. учета.
//
Процедура ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти,ИмяТабличнойЧасти, ДопПараметры, ВалютаРегламентированногоУчета,
                                              ВалютаДокумента =Неопределено, Знач ТипЦен = Неопределено, ЭтоРозница = Ложь) Экспорт


//	Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
//		ТекТипЦен = ДокументОбъект.ТипЦен;
//	Иначе
//		ТекТипЦен = ТипЦен;
//	КонецЕсли;

//	ХарактеристикаНоменклатуры = ОбработкаТабличныхЧастей.ПолучитьЗначениеРеквизитаТЧ(МетаданныеДокумента, ИмяТабличнойЧасти, СтрокаТабличнойЧасти, "ХарактеристикаНоменклатуры");

//	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
//		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента) Тогда
//			ВалютаДокумента    = ДокументОбъект.ВалютаДокумента;
//			КурсДокумента      = ЗаполнениеДокументов.КурсДокумента(ДокументОбъект, ВалютаРегламентированногоУчета);
//			КратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ДокументОбъект, ВалютаРегламентированногоУчета);
//		Иначе

//			// Если есть цена и тип цен, но нет валюты, тогда в качестве валюты документа возьмем валюту регламентированного учета.
//			ВалютаДокумента    = ВалютаРегламентированногоУчета;
//			КурсДокумента      = 1;
//			КратностьДокумента = 1;
//		КонецЕсли;
//	Иначе
//		СтруктураВалюты    = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ДокументОбъект.Дата);
//		КурсДокумента      = СтруктураВалюты.Курс;
//		КратностьДокумента = СтруктураВалюты.Кратность;
//	КонецЕсли;

//	ТекСклад = ОбщегоНазначения.ПолучитьРеквизитШапки("Склад", ДокументОбъект, МетаданныеДокумента);
//	Если ТекСклад = Неопределено Тогда
//		ТекСклад = ОбщегоНазначения.ПолучитьРеквизитШапки("СкладОрдер", ДокументОбъект, МетаданныеДокумента, Справочники.Склады.ПустаяСсылка());

//		Если ТипЗнч(ТекСклад) <> Тип("СправочникСсылка.Склады") Тогда
//			ТекСклад = Справочники.Склады.ПустаяСсылка();
//		КонецЕсли;
//	КонецЕсли;

//	Если ЭтоРозница И ТекСклад.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
//		Если НЕ ЗначениеЗаполнено(ТекСклад) Тогда
//			
//			// берем из самого реквизита Номенклатура
//			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ЕдиницаИзмерения", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
//				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков;
//				
//				Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Коэффициент", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
//					СтрокаТабличнойЧасти.Коэффициент      = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
//				КонецЕсли;
//				
//			КонецЕсли;
//			
//			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Цена", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
//				СтрокаТабличнойЧасти.Цена      = 0;
//			КонецЕсли;
//			
//			
//		Иначе
//			
//		// Если единица оказалась не заполненной, то заполняем ее основной единицей номеклатуры
//			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ЕдиницаИзмерения", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
//				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков;
//			КонецЕсли;
//			
//			Цена = УправлениеРозничнойТорговлей.ПолучитьПродажнуюЦену(ДокументОбъект.Дата, СтрокаТабличнойЧасти.Номенклатура,
//			   ХарактеристикаНоменклатуры, ТекСклад, ОбщегоНазначения.ПолучитьРеквизитШапки("УсловиеПродаж",
//			   ДокументОбъект, МетаданныеДокумента));

//			Цена = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(Цена, ВалютаРегламентированногоУчета,
//			   ВалютаДокумента, КурсДокумента, КратностьДокумента, ДокументОбъект.Дата);

//			// Если цену заполнили из регистра, то ее надо пересчитывать по флагам налогообложения.
//			Если НЕ ЗначениеЗаполнено(Цена) Тогда
//				СтрокаТабличнойЧасти.Цена = 0;
//			Иначе
//				СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,
//							Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
//							Истина,
//							ОбщегоНазначения.ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента)
//							И ДокументОбъект.УчитыватьНДС,
//							ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаВключаетНДС", МетаданныеДокумента)
//							И ДокументОбъект.СуммаВключаетНДС,
//							?(ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СтавкаНДС", МетаданныеДокумента, ИмяТабличнойЧасти),
//							УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС),0));
//			КонецЕсли;

//		КонецЕсли;
//		
//	Иначе
//		
//		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ЕдиницаИзмерения", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
			ЕдиницаИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения;
//		Иначе
//			ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков;
//		КонецЕсли;
//		
//		Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, ХарактеристикаНоменклатуры,
//										ТекТипЦен, ДокументОбъект.Дата, ЕдиницаИзмерения,
//										ВалютаДокумента, КурсДокумента, КратностьДокумента, ,
//										ОбщегоНазначения.ПолучитьРеквизитШапки("ДоговорКонтрагента", ДокументОбъект, МетаданныеДокумента),
//										ОбщегоНазначения.ПолучитьРеквизитШапки("УсловиеПродаж", ДокументОбъект, МетаданныеДокумента));

//		// Если цену заполнили из регистра, то ее надо пересчитывать по флагам налогообложения.
//		Если НЕ ЗначениеЗаполнено(Цена) Тогда
//			СтрокаТабличнойЧасти.Цена = 0;
//		Иначе
//			СтрокаТабличнойЧасти.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,
//						Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
//						ТекТипЦен.ЦенаВключаетНДС,
//						ОбщегоНазначения.ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента)
//						И ДокументОбъект.УчитыватьНДС,
//						ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаВключаетНДС", МетаданныеДокумента)
//						И ДокументОбъект.СуммаВключаетНДС,
//						?(ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СтавкаНДС", МетаданныеДокумента, ИмяТабличнойЧасти),
//						УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС),0));
//		КонецЕсли;
//		
		Если СтрокаТабличнойЧасти.Свойство("ЕдиницаИзмерения") Тогда
			
			Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = ЕдиницаИзмерения;
			Иначе	
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков;
			КонецЕсли;			 
			
		КонецЕсли;			 
			
	//КонецЕсли;

	Если  СтрокаТабличнойЧасти.Свойство("Коэффициент") Тогда
		СтрокаТабличнойЧасти.Коэффициент      = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
	КонецЕсли;

	//РассчитатьКоличествоТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
	//
	//ЗаполнитьЕдиницуМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);

КонецПроцедуры // ЗаполнитьЕдиницуЦенуПродажиТабЧасти()
